import { IDataBlock } from "@/data/model";

export const Data: IDataBlock[] = [
    {
        id: 0,
        name: "Технологии",
        objects: [
            { date: 1980, description: "Sinclair Research выпускает домашний компьютер ZX80." },
            { date: 1982, description: "Появился домашний компьютер ZX Spectrum, выпущенный британской компанией Sinclair Research." },
            { date: 1983, description: "Введение в продажу первого персонального компьютера IBM PC XT с жестким диском и расширяемой архитектурой." },
            { date: 1984, description: "Выпуск первого Macintosh от Apple, который стал известен своим графическим интерфейсом и мышью." },
            { date: 1985, description: "Появление Windows 1.0 от Microsoft, что стало началом эры графических операционных систем на платформе PC." },
            { date: 1985, description: "Запуск Nintendo Entertainment System (NES) в США, который положил начало новой эре в индустрии видеоигр." },
            { date: 1986, description: "Выпуск первого процессора Intel 80386, который стал основой для многих последующих персональных компьютеров." },
        ],
    },
    {
        id: 1,
        name: "Кино",
        objects: [
            { date: 1987, description: "«Хищник»/Predator, США (реж. Джон Мактирнан)." },
            { date: 1988, description: "«Кто подставил кролика Роджера»/Who framed Roger Rabbit, США (реж. Роберт Земекис)." },
            { date: 1989, description: "«Назад в будущее 2»/Back to the future 2, США (реж. Роберт Земекис)." },
            { date: 1990, description: "«Крепкий орешек 2»/Die hard 2, США (реж. Ренни Харлин)." },
            { date: 1991, description: "«Семейка Адамс»/The Adams Family, США (реж. Барри Зонненфельд)." },
        ],
    },
    {
        id: 2,
        name: "Литература",
        objects: [
            { date: 1992, description: "Нобелевская премия по литературе — Дерек Уолкотт, «За блестящий образец Карибского эпоса в 64 разделах»." },
            { date: 1994, description: "Бессонница — роман Стивена Кинга." },
            { date: 1995, description: "Нобелевская премия по литературе — Шеймас Хини." },
            { date: 1997, description: "«Гарри Поттер и философский камень» — Джоан Роулинг." }
        ],
    },
    {
        id: 3,
        name: "Театр",
        objects: [
            { date: 1999, description: "Премьера балета «Золушка» в постановке Жан-Кристофа Майо, сценография Эрнеста Пиньона." },
            { date: 2000, description: "Возобновлено издание журнала «Театр»." },
            { date: 2002, description: "Премьера трилогии Тома Стоппарда «Берег Утопии», Королевский Национальный Театр, Лондон." },
            { date: 2003, description: "В Венеции был закрыт театр «Ля Фениче» в результате пожара." },
            { date: 2004, description: "Открытие в Москве Театра Наций." },
        ],
    },
    {
        id: 4,
        name: "Спорт",
        objects: [
            { date: 2006, description: "Баскетбольный клуб ЦСКА стал победителем национального первенства России." },
            { date: 2008, description: "С 8 по 24 августа в Пекине прошли 29-е лентие Олимпийские игры." },
            { date: 2010, description: "12-28 февраля в Ванкувере: Зимние Олимпийские игры 2010 года." },
            { date: 2012, description: "2 августа - Летние Олимпийские игры." },
            { date: 2014, description: "XXII Зимние Олимпийские игры (Сочи, Россия)." },
        ],
    },
    {
        id: 5,
        name: "Наука",
        objects: [
            { date: 2015, description: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды." },
            { date: 2016, description: "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11." },
            { date: 2017, description: "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi." },
            { date: 2018, description: "Старт космического аппарата Solar Probe Plus, предназначенного для изучения Солнца." },
            { date: 2019, description: "Google объявил о создании 53-кубитного квантового компьютера." },
            { date: 2020, description: "Корабль Crew Dragon вернулся на Землю из первого пилотируемого полета." },
            { date: 2022, description: "NASA успешно запустило миссию Artemis I, которая стала первым шагом к возвращению людей на Луну." },
        ],
    },
];
